# 접근자(Accessor) 실습
- DF/SR에 속성으로 제공되며, 다른 객체의 기능/속성을 사용할 수 있도록 해줌
- 종류
    - Series.dt : datetime관련 속성 사용할 수 있도록 해줌
    - Series.str : string관련 메서드 사용할 수 있도록 해줌
    - Dataframe.spare : spare관련 속성/메서드 사용할 수 있도록 해줌

In [15]:
# 모듈 로딩
import pandas as pd
import datetime

# 데이터 생성
# 이름, 생년월일, 나이 3개 컬럼으로 구성, 총 10명
# 생년월일 : 동년해, 동일날짜
# 이름 : 영문(ex. Tom Kim)
dataDF = pd.DataFrame({'Name':['Lim Jae', 'Tom Kim','Hong Ju', 'Park soo', 'Lim Chae', 'Ma JingGa', 'Chul Su', 'Young Hee', 'Red Park', 'Young Woo'],
                      'Birth':pd.date_range('1996-01-07', periods=10, freq='MS'),
                      'Age':[27,27,27,27,27,27,27,27,27,27]})
dataDF

        Name      Birth  Age
0    Lim Jae 1996-02-01   27
1    Tom Kim 1996-03-01   27
2    Hong Ju 1996-04-01   27
3   Park soo 1996-05-01   27
4   Lim Chae 1996-06-01   27
5  Ma JingGa 1996-07-01   27
6    Chul Su 1996-08-01   27
7  Young Hee 1996-09-01   27
8   Red Park 1996-10-01   27
9  Young Woo 1996-11-01   27

In [16]:
# Name에서 성. 이름 분리하기
dataDF['Name'][0]

'Lim Jae'

In [17]:
dataDF['Name'][0].split(' ')

['Lim', 'Jae']

# Str 데이터로 구성된 Series에서 str 접근자 사용
- 전체 컬럼의 요소에 str관련 메서드 사용 가능하도록 하는 접근자
- 사용법
    - 객체변수(컬럼명).str.사용메서드()
    - 객체변수(컬럼명).str.get(인덱스) => 분리 문자리스트에서 특정 요소 추출

In [18]:
# 그렇다면 Seires 객체에 split을 사용할 수는 없을까? => str 접근자 사용
dataDF['Name'].str.split()

0      [Lim, Jae]
1      [Tom, Kim]
2      [Hong, Ju]
3     [Park, soo]
4     [Lim, Chae]
5    [Ma, JingGa]
6      [Chul, Su]
7    [Young, Hee]
8     [Red, Park]
9    [Young, Woo]
Name: Name, dtype: object

In [19]:
# 문자열 분리
flname = dataDF['Name'].str.split()
flname.str.get(0)

0      Lim
1      Tom
2     Hong
3     Park
4      Lim
5       Ma
6     Chul
7    Young
8      Red
9    Young
Name: Name, dtype: object

In [20]:
# 분리된 문자열 리스트에서 특정 값 가져와서 column insert 시키기
dataDF.insert(1, 'First Name', flname.str.get(0))
dataDF.insert(2, 'Last Name', flname.str.get(1))

In [21]:
dataDF

        Name First Name Last Name      Birth  Age
0    Lim Jae        Lim       Jae 1996-02-01   27
1    Tom Kim        Tom       Kim 1996-03-01   27
2    Hong Ju       Hong        Ju 1996-04-01   27
3   Park soo       Park       soo 1996-05-01   27
4   Lim Chae        Lim      Chae 1996-06-01   27
5  Ma JingGa         Ma    JingGa 1996-07-01   27
6    Chul Su       Chul        Su 1996-08-01   27
7  Young Hee      Young       Hee 1996-09-01   27
8   Red Park        Red      Park 1996-10-01   27
9  Young Woo      Young       Woo 1996-11-01   27